/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   098.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ggul_jam <ggul_jam@icloud.com>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/06 12:11:39 by ggul_jam          #+#    #+#             */
/*   Updated: 2022/05/06 12:19:10 by ggul_jam         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
int main(void)
{
	puts("-------------------------");
	puts(" * if 문 -1");
	puts("-------------------------");
	
	if (100) {
		puts("대한민국은 민주공화국이다");
		puts("모든 주권은 국민으로부터 나온다");
		puts("한국은 월드컵 4강에 든 전설이 있다");
	}
	puts("-----------------------------------------------");
	puts("블럭 표시가{}가 없으면 첫 번째 ; 까지만 해당 ");
	puts("블럭 표시가 있으면 참이면 실행 하고 거짓이면 지나감");
	return 0;
}
