/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   104.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ggul_jam <ggul_jam@icloud.com>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/06 18:58:18 by ggul_jam          #+#    #+#             */
/*   Updated: 2022/05/06 19:02:10 by ggul_jam         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
int main(int argc, char *argv[])
{
	char i = 65;
	puts(" * goto 문 ");
To: 
	printf("%d\n", i);
	putchar(i++);
	if (i < 91) {
		goto To;
	}
	puts("--------------------------------------");
	puts(" To: 이정표이다.");
	puts(" goto To ; To 이정표로 가라 ");
	puts(" goto 문은 무조건 분기문 이다.");

	return 0;
}
