/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   114.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ggul_jam <ggul_jam@icloud.com>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/07 14:43:42 by ggul_jam          #+#    #+#             */
/*   Updated: 2022/05/07 14:46:13 by ggul_jam         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
int main(void)
{
	int a = 10;
	puts(" * 증감 연산자 ");
	
	a = 10;
	printf("a = %d\n", ++a);
	a = 10;
	printf("a = %d\n", --a);
	a = 10;
	printf("a = %d\n", a++);
	a = 10;
	printf("a = %d\n", a--);

	puts(" 앞에 나오면 먼저, 뒤에 나오면 뒤에");
	puts(" 순서대로 해석 하면 됩니다.");
	return 0;
}
