/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   115.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ggul_jam <ggul_jam@icloud.com>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/07 14:48:10 by ggul_jam          #+#    #+#             */
/*   Updated: 2022/05/07 14:51:07 by ggul_jam         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
int main(void)
{
	puts(" * 나눗셈 연산자 ");

	printf("10 / 3 = %d \n", 10/3);
	printf("10 %% 3 = %d\n", 10%3 );

	puts(" C언어에서 나눗셈은 두가지다 .");
	puts("/ => 몫을 구한다, % => 나머지를 구한다.");
	puts("정수 / 정수 = 정수 ");
	puts("정수 / 실수 = 실수 ");
	puts("실수 / 정수 = 실수 ");
	puts("실수 / 실수 = 실수 ");

	
	return 0;
}
