/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   126.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ggul_jam <ggul_jam@icloud.com>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/07 20:50:52 by ggul_jam          #+#    #+#             */
/*   Updated: 2022/05/07 20:54:44 by ggul_jam         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
int main(void)
{
	int a; 
	puts(" * puts 함수");
	a = puts("africa");
	printf(" return 값a = %d \n",a);

	puts("\n------------------------");
	puts("puts 함수는 문자열 출력 전용 함수 ");
	puts(" 성공하면 음수가 아닌 값을 리턴 해요.");
	puts(" 그냥 0 을 리턴한다고 생각 하세요 .");
	puts(" 실패하면 EOF를 리턴 합니다");
	return 0;
}
